#include <iostream>
#include <random>
#include <string>
#include <unistd.h>
#include <stdlib.h>

using namespace std;

void test ()
{
  cout << "___________________________________________________________________________________________________________________________________________________________________________________________________________________" << endl; 
  cout << "|                                                                     |   СТАРНЫ:                                                            |   ГОРОДА:                                                          |" << endl;
  cout << "|                                                                     |  Америка                                                             |                                                                    |" << endl; 
  cout << "|                                                                     |  Германия                                                            |                                                                    |" << endl;
  cout << "|      . . . . . . . . . . . . . . . . .  .                           |  Англия                                                              |   Вашингтон                                                        |" << endl; 
  cout << "|   . .                                      .            .           |  Франция                                                             |   Нью-Йорк                                                         |" << endl;
  cout << "|   .                                         .       .  *.           |  Украина                                                             |   Сан-Франциско                                                    |" << endl; 
  cout << "|   .                                           .   .  * .            |  Эфиопия                                                             |   Лос-Анджелес                                                     |" << endl;
  cout << "|   .                                             .     .             |  Урогвай                                                             |   Сан-Диего                                                        |" << endl; 
  cout << "|   .                                                * .              |  Японци                                                              |   Чикаго                                                           |" << endl;
  cout << "|   . *                                             * .               |                                                                      |   Детройт(Become humen)                                            |" << endl;  
  cout << "|   .                                                .                |                                                                      |   Ричмонд                                                          |" << endl;
  cout << "|   . .                                           *    .              |                                                                      |                                                                    |" << endl; 
  cout << "|      .  *                                          .                |                                                                      |                                                                    |" << endl;
  cout << "|         .                            . .  .    *  .                 |                                                                      |                                                                    |" << endl; 
  cout << "|           . *         .           .      .     .                    |                                                                      |                                                                    |" << endl;
  cout << "|             . . . .  .  .        .         .    .                   |                                                                      |                                                                    |" << endl;   
  cout << "|                          .     .            .    .                  |                                                                      |                                                                    |" << endl;
  cout << "|                           .   .               .    .                |                                                                      |                                                                    |" << endl; 
  cout << "|                             .                   .* .                |                                                                      |                                                                    |" << endl;
  cout << "|                                                  .                  |                                                                      |                                                                    |" << endl; 
  cout << "|                                                                     |                                                                      |                                                                    |" << endl;
  cout << "|                                                                     |                                                                      |                                                                    |" << endl; 
  cout << "|_________________________________________________________________________________________________________________________________________________________________________________________________________________|" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|  ЗАПУСК РАКЕТ                                                                                                                                                                                                   |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|                                                                                                                                                                                                                 |" << endl; 
  cout << "|                                                                                                                                                                                                                 |" << endl;
  cout << "|_________________________________________________________________________________________________________________________________________________________________________________________________________________|" << endl; 
 
  
}


int main() 
{
  for(int i = 0; i < 30; i++)
  system("clear");
  test();

  return 0;
}