#include  <iostream>
#include <string>
#include <ctime>

using namespace std;

void Trips()
{
    srand(time(0));
    int a[2]; // вторая дорожка чтолько сколко будет вырных клеток
    int b[2]; // третья и четвёртая клетка сколько будет верных дорожек
    int c[5];
    int lose;
    int move;
    int bet;
    int answ[5][3]{
    {1, 1, 1},
    {0, 0, 0},
    {0, 0, 0},
    {0, 0, 0},
    {0, 0, 0},
    };
    string square[7] = {"|---------------|",
                        "|               |",
                        "|               |",
                        "|       ?       |",
                        "|               |",
                        "|               |",
                        "|---------------|", };
    string squarelose[7] = {"|---------------|",
                        "|\033[1;41m               \033[0m|",
                        "|\033[1;41m               \033[0m|",
                        "|\033[1;41m       ?       \033[0m|",
                        "|\033[1;41m               \033[0m|",
                        "|\033[1;41m               \033[0m|",
                        "|---------------|", };
    string squarewin[7] = {"|---------------|",
                        "|\033[1;42m               \033[0m|",
                        "|\033[1;42m               \033[0m|",
                        "|\033[1;42m       ?       \033[0m|",
                        "|\033[1;42m               \033[0m|",
                        "|\033[1;42m               \033[0m|",
                        "|---------------|", };

// Заполнение а
    a[0] = rand() % 3 - 1;
    for (int i = 0; i < 3; i++) {
        a[1] = rand() % 3 + 1;
        // cout << a[i] << endl;
        if (i == 2 and a[1] == a[0]) {
        // cout << "AXAXAX" << endl;
        i = 0;
        }
    }

// Заполенение b
    b[0] = rand() % 3 - 1;
    for (int i = 0; i < 3; i++) {
        b[1] = rand() % 3 + 1;
        // cout << b[i] << endl;
        if (i == 2 and b[1] == b[0]) {
        // cout << "AXAXAX" << endl;
        i = 0;
        }
    }    

// Заполнение всех верных полей в один масив
    for (int i = 0; i < 5; i++) {
        for (int j = 0;j < 3; j++){
            if (i == 1){
                answ[i][a[j]] = 1;
                // answ[i][a[0]] = 1;
            }
            if (i == 2)
            {
                answ[i][b[0]] = 1;
            }
            if (i == 3){
                answ[i][b[1]] = 1;
            }
            if (i == 4){}
        }
    }

    

    // for (int i = 0; i < 3; i++ ) {
    //     for(int j = 0; j < 5; j++){
    //         cout << '[' << i << "] " << answ[j][i] << ' ';
    //     }
    //     cout << endl;
    // }
    cout << "Ваша ставка: ";
    cin >> bet;

// Отрисовка
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 7; j++)
        {
            for (int k = 0; k < 5; k++)
            {
                // if(answ[k][i] == 1){
                //     cout << squarewin[j];
                // }else{
                    cout << square[j];
                // }
            }
            cout << endl;
        }
    }
    cin >> c[0];
    c[0]--;
    for (int i = 0; i < 5; i++)
    {
        if (c[i] == 3)
            {
                cout << "Игра окончена" << endl;
                if (i - 1 == 0 ){
                    cout << "Вы выиграли: " << bet << endl;
                }
                if (i - 1 == 1 ){
                    cout << "Вы выиграли: " << bet * 1.25 << endl;
                }
                if (i - 1 == 2 ){
                    cout << "Вы выиграли: " << bet * 2 << endl;
                }
                if (i - 1 == 3 ){
                    cout << "Вы выиграли: " << bet * 3 << endl;
                }
                
                break;
            }
        for (int j = 0; j < 3; j++){
            
            
            if (lose != 1)

            {
                move = i;
                cout << "ты угодал" << endl;  
                system("clear");
                for (int k = 0; k < 3; k++)
                {
                    for (int l = 0; l < 7; l++)
                    {
                        for (int m = 0; m < 5; m++)
                        {
                            if (answ[i][c[i]] == 1)
                            {
                                if(c[m] == k and m == move){
                                    cout << squarewin[l];
                                }else{
                                    cout << square[l];
                                }
                            }else{
                                lose = 1;
                                if(c[m] == k and m == move){
                                    cout << squarelose[l];
                                }else{
                                    cout << square[l];
                                }
                            }
                        }
                        cout << endl;
                    }
                }  
                
            }
            if (lose == 1){
                lose = 1;
                cout << "Ты проиграл" << endl;
                break;
            }
            cin >> c[i + 1];
            c[i + 1]--;
            break;
        }
        if(lose == 1)
            break;

    }
}

// int main()
// {

//     // string square[2] = {"",
//     //                     ""}; 
    
                            	   	   	   	   	   	

//     // cout << "|---------------||---------------||---------------||---------------||---------------|" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|       ?       ||       ?       ||       ?       ||       ?       ||       ?       |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|---------------||---------------||---------------||---------------||---------------|" << endl;
//     // cout << "|---------------||---------------||---------------||---------------||---------------|" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|       ?       ||       ?       ||      ?        ||       ?       ||       ?       |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|---------------||---------------||---------------||---------------||---------------|" << endl;
//     // cout << "|---------------||---------------||---------------||---------------||---------------|" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|      ?        ||       ?       ||       ?       ||       ?       ||       ?       |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|               ||               ||               ||               ||               |" << endl;
//     // cout << "|---------------||---------------||---------------||---------------||---------------|" << endl;
    
//     // cout << "\033[1;42mbold red text\033[0m\n" << endl;
//     // cout << "\033[1;41m        \033[0m\n" << endl;
// }

